#+latex_compiler: lualatex
#+latex_header: \usepackage{fontconfig}
#+latex_header: \setmainfont{Noto Sans}
#+latex_header: \setmonofont{Iosevka}

* emacs-organizer

** text-and-code-editor

*** package-management

**** archives
#+begin_src elisp
  (require 'package)
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t)
#+end_src

#+RESULTS:
: ((gnu . https://elpa.gnu.org/packages/) (nongnu . https://elpa.nongnu.org/nongnu/) (melpa . https://melpa.org/packages/))


**** profiling
#+begin_src elisp
  (setq use-package-compute-statistics 't)
#+end_src

#+RESULTS:
: t

**** automatic-install-on-startup
#+begin_src elisp
  (setopt use-package-always-ensure 't)
#+end_src

#+RESULTS:
: t

*** layout-and-language
#+begin_src elisp
  (use-package reverse-im
  :ensure t
  :init (reverse-im-mode)
  :custom
  (reverse-im-input-methods '("cyrillic-colemak"))
  (reverse-im-cache-file "~/.cache/emacs/reverse-im-cache.el")
  :pin melpa)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 25729 243097 399000) :init (27160 25729 243091 236000) :config (27160 25729 243067 405000) :config-secs (0 0 5 374000) :init-secs (0 0 2607 829000) :use-package-secs (0 0 2831 170000)))

**** spellcheck
#+begin_src elisp
  (use-package ispell
  :commands (ispell ispell-region ispell-word)
  :config
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "en_US,ru_RU")
  :custom
  (ispell-program-name "hunspell")
  (ispell-dictionary "en_US,ru_RU")
   ;; store into personal wiki
  (ispell-personal-dictionary "~/howm/.hunspell_personal")) 
#+end_src

**** locale
#+begin_src elisp
    (setq system-time-locale "C") ;; for org-pomodoro

  ;; for loading config in org-mode
  (defvar *fs-encoding* 'utf-8)
  (prefer-coding-system 'utf-8-unix)

#+end_src

*** theming

**** icons

#+begin_src elisp
  (setopt icon-map-list nil)
#+end_src

#+RESULTS:

**** tabs-by-default
#+begin_src elisp
  (tab-bar-mode) 
#+end_src

**** key-suggestions
#+begin_src elisp
    (which-key-mode)
#+end_src

#+RESULTS:
: t

**** line-wrap
#+begin_src elisp
    (global-visual-line-mode)
#+end_src

#+RESULTS:
: t


**** modus-themes
#+begin_src elisp
  (use-package modus-themes
    :init (load-theme 'modus-operandi)
    :when (not (eq window-system nil)))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 27571 653768 701000) :init (27160 27571 653765 853000) :config (27160 27571 653757 179000) :config-secs (0 0 2 182000) :init-secs (0 0 134125 447000) :use-package-secs (0 0 134195 610000)))

*** fancy-autocomplete

**** fuzzy-search
#+begin_src elisp
  (use-package vertico
  :init (vertico-mode)
     (setq completion-in-region-function
	   (lambda (&rest args)
	     (apply (if vertico-mode
			   #'consult-completion-in-region
		      #'completion--in-region)
		    args))))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 27631 123583 394000) :init (27160 27631 123575 899000) :config (27160 27631 123557 598000) :config-secs (0 0 3 576000) :init-secs (0 0 143 694000) :use-package-secs (0 0 214 27000)))

**** language-server-client
#+begin_src elisp
(use-package consult)

(use-package consult-eglot :commands (eglot))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 27624 428696 232000) :init (27160 27624 428687 267000) :init-secs (0 0 79 32000) :use-package-secs (0 0 117 693000)))

*** file-management
#+begin_src elisp
    (use-package dired
      :custom (dired-dwim-target t)
      :ensure nil)
#+end_src

*** git-gui
#+begin_src elisp
  (use-package magit :commands (magit))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 28460 223796 389000) :init (27160 28460 223794 331000) :config (27160 28460 223781 946000) :config-secs (0 0 1 850000) :init-secs (0 0 20 551000) :use-package-secs (0 15 533762 601000)))

#+begin_src elisp
(use-package git-modes)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 28441 320806 446000) :init (27160 28441 320803 246000) :config (27160 28441 320794 9000) :config-secs (0 0 2 148000) :init-secs (0 0 654 63000) :use-package-secs (0 1 716063 257000)))

** personal-wiki
#+begin_src elisp
  (use-package howm
  :init (when (not (eq system-type 'windows-nt))
          (setq howm-view-use-grep t))
  :custom
  (howm-search-other-dir t)
  :pin melpa)
#+end_src

*** use-any-markup
#+begin_src elisp
  (defun howm-insert-prop-line (&optional mode)
  "Enable & save major MODE to the -*- line to use it with howm."
  (interactive (list (intern
                      (completing-read "Choose major mode: "
                                       (mapcar #'cdr auto-mode-alist)
                                       nil t))))
  (funcall mode)
  (howm-mode)
  (add-file-local-variable-prop-line
   'mode (intern (string-trim-right (symbol-name mode) "-mode"))))
;; programmatically:  (howm-insert-prop-line 'c-mode)
#+end_src

#+RESULTS:
: howm-insert-prop-line

*** pomodoro-time-tracker

**** classical-pomodoro
#+begin_src elisp
  (use-package org-pomodoro
  :custom
  (org-pomodoro-keep-killed-pomodoro-time 't)
  (org-pomodoro-length 80)
  (org-pomodoro-short-break-length 15)
  (org-pomodoro-long-break-length 35)
  :pin melpa)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 27713 920766 341000) :init (27160 27713 920759 883000) :config (27160 27713 920742 872000) :config-secs (0 0 3 228000) :init-secs (0 0 25 904000) :use-package-secs (0 0 158 409000)))

**** third-time
#+begin_src elisp
(use-package org-pomodoro-third-time
  :vc (:url "git@github.com:telotortium/org-pomodoro-third-time.git")
  :init  (org-pomodoro-third-time-mode))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 27710 184520 369000) :init (27160 27710 184513 448000) :config (27160 27710 184493 419000) :config-secs (0 0 4 554000) :init-secs (0 0 594 604000) :use-package-secs (0 0 629 508000)))

*** integrated-flashcards
#+begin_src elisp
  (use-package org-drill
      :pin melpa)


(defun my-org-drill-file-names-in-howm ()
  "Return list of absolute filenames of org-drill files in howm"
  (delete-dups
   (mapcar #'car (howm-grep "\:drill\:"
			    (howm-files-in-directory howm-directory)))))


(defun my-org-drill-set-scope ()
  (interactive)
  (let ((scope-var
	 (completing-read "Choose scope for org-drill: " (list
		   "howm"
		   "file"
		   "tree"
		   "file-no-restriction"
		   "agenda"
		   "agenda-with-archives"
		  "directory"))))
    (if (equal scope-var "howm")
	(setq org-drill-scope (my-org-drill-file-names-in-howm))
      (setq org-drill-scope (intern scope-var)))))


(define-advice org-drill (:before (&rest _args))
  (my-org-drill-set-scope))

(define-advice org-drill-cram (:before (&rest _args))
  (my-org-drill-set-scope))

(defun org-drill-time-to-inactive-org-timestamp (time)
  "Convert TIME into org-mode timestamp."
  (format-time-string
   (concat "[" (cdr org-time-stamp-formats) "]")
   time))

#+end_src

** TeX-editor
#+begin_src elisp
      (use-package auctex
      :init (setq TeX-auto-save t)
      (setq TeX-parse-self t)
      (setq-default TeX-master nil)
      :pin gnu)

    (setq-default TeX-engine 'luatex)
#+end_src

#+RESULTS:
: luatex

** mail-client

*** user-info
#+begin_src elisp
    (setq 
     user-full-name "artsi0m"
     user-mail-address "karakin2000@gmail.com")
#+end_src

#+RESULTS:
: karakin2000@gmail.com

*** smtp
#+begin_src elisp
  (use-package smtpmail
    :custom
    (smtpmail-smtp-server "smtp.gmail.com")
     (smtpmail-stream-type 'starttls )
     (smtpmail-smtp-service 587)
     (smtpmail-servers-requiring-authorization "*")
     (send-mail-function 'smtpmail-send-it)
     :ensure nil)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 29509 944260 380000) :init (27160 29509 944253 59000) :config (27160 29509 944232 831000) :config-secs (0 0 4 59000) :init-secs (0 0 102 100000) :use-package-secs (0 0 217 736000)))

*** imap
#+begin_src elisp
    (use-package gnus
      :custom
         (gnus-save-score t)
         (gnus-startup-file "~/howm/.newsrc")
         (gnus-backup-startup-file 'never)
         (gnus-select-method
         '(nnimap "gmail"
    	      (nnimap-address "imap.gmail.com")
    	      (nnmail-expiry-target "nnimap+gmail:[Gmail]/Корзина")
    	      (nnimap-server-port 993)
    	      (nnimap-stream ssl)
    	      (gnus-search-engine gnus-search-imap)
    	      (nnmail-expiry-wait immediate)))
         :ensure nil)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 29706 452023 100000) :init (27160 29706 452012 289000) :config (27160 29706 451987 743000) :config-secs (0 0 7 715000) :init-secs (0 0 178 634000) :use-package-secs (0 0 300 212000)))

** book-reader
*** epub
#+begin_src elisp
  (use-package nov)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (27160 28255 979839 247000) :init (27160 28255 979837 396000) :config (27160 28255 979827 179000) :config-secs (0 0 2 55000) :init-secs (0 0 2924 164000) :use-package-secs (0 3 531683 180000)))

